package student.katerin.lesson2.level7;

/*Напишите программу и продемонстрируйте в ней использование
однострочного и многострочного коментариев.*/

public class CommentCode {
    public static void main(String[] args) {

        //int a=3,b=4,c=6;

        /*System.out.println("Sum="+(a+b));
        System.out.println("Hello!");*/
    }
}
