/*Создайте класс NullPointerExceptionDemo
и в main() методе этого класса напишите код,
который приводит к появлению NullPointerException.
В комментариях напишите, когда происходит NullPointerException.*/

package level3;

public class NullPointerExceptionDemo {
    public static void main(String[] args) {
        Integer num;
        System.out.println(num);//тут
    }
}


