/*Напишите программу, которая демонстрирует использование команды
    System.out.print("text");*/

package student.katerin.lesson2.level5;

public class PrintNextString {
    public static void main(String[] args) {
        System.out.println("string1");
        System.out.println("string2");
        System.out.println("string3");

    }
}
