package Calculator.Application;

public class Menu {

    public static void menu() {

        System.out.println("_________________________________________");
        System.out.println("Выберите операцию: " + "\n"
                + "1: Сложение" + "\n"
                + "2: Вычитание" + "\n"
                + "3: Умножение" + "\n"
                + "4: Деление" + "\n"
                + "5: Четности числа" + "\n"
                + "6: Большее из двух чисел" + "\n"
                + "7: Большее из трех чисел" + "\n"
                + "8: Выход!");
        System.out.println("_________________________________________");

    }
}
